package com.rpg;

/**
 * Задание: Необходимо реализовать архитектуру для РПГ игры.
 *
 *  1. В игре 4 класса: Войн, Маг, Лучник, Разбойник.  Все персонажи обладают общими характеристиками, а также особыми, характерными для каждого класса.
 *
 *  2. Также у каждого персонажа есть свои уникальные навыки(скиллы).
 *
 *  3. В игре присутствует возможность добавлять в друзья
 *
 *  4. В игре присутствует возможность создавать группу из игроков.
 *
 */
public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
